Revit 2027 API
ExternalApplicationArray.GetEnumerator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator
public:
virtual IEnumerator^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator
override GetEnumerator : unit -> IEnumerator
Return Value
IEnumerator
Returns a forward moving iterator to the array.
Implements
IEnumerable.GetEnumerator()
See Also
Reference
ExternalApplicationArray Class
Autodesk.Revit.UI Namespace